app/views/tweets/show.html.erb

	<div class="container">
		<h2 class="subtitle is-5"><strong><%= @tweet.comments.count %></strong> Comments</h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" = ?  [["tweet_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."tweet_id" = ?  [["tweet_id", 1]]