app/views/users/index.html.erb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ? ORDER BY "tweets"."created_at" DESC  [["user_id", 1]]
---
 <li><%= link_to user.username, user_path(user) %></li>
 <% user.tweets.each do |tweet| %>