app/views/users/show.html.erb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ? ORDER BY "tweets"."created_at" DESC  [["user_id", 1]]
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]
---

      <span><b>Tweets:</b> <%= @user.tweets.count %></span>
      <ul>
 <% @user.tweets.reverse.each do |tweet| %>