app/controllers/sessions_controller.rb

  def create
    if request.env["omniauth.auth"]

       @user = User.find_or_create_by(uid: auth['uid']) do |u|
          u.name = auth['info']['username']
          u.email = auth['info']['email']


        end

        @user.password = SecureRandom.hex(9)
       @user.save


          session[:user_id] = @user.id
          redirect_to edit_user_path(@user.id)
         # redirect_to dashboard_path(@user.id)
       else
      user = User.find_by(email: params[:user][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "user@try.com"], ["LIMIT", 1]]