app/controllers/tweets_controller.rb

SELECT  "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" DESC, created_at DESC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @users = User.all
        @user = User.new
        @tweets = Tweet.all.order("created_at DESC")

SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" = ?  [["tweet_id", 1]]
---
    def show
      @comment = Comment.new
      @comments = @tweet.comments.all

INSERT INTO "tweets" ("tweet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweet", "12:27 April 29"], ["created_at", "2019-04-29 16:27:25.623845"], ["updated_at", "2019-04-29 16:27:25.623845"], ["user_id", 6]]
---
    def create
    @tweet = current_user.tweets.build(tweet_params)

     if @tweet.save

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? ORDER BY "tweets"."created_at" DESC LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_tweet
        @tweet = Tweet.find_by(id:params[:id])